app/views/tasks/_form.html.erb

SELECT "users".* FROM "users"
---
  <div class="col-sm-4">
   <%= task.collection_select(:owner_id, User.all, :id, :email, html: {class: "form-control"}) %>