app/views/projects/_form.html.erb

  <div class="col-sm-4">
   <%= p.collection_select(:user_id, User.all, :id, :email, html: {class: "form-control"}) %>
---
SELECT "users".* FROM "users"