app/controllers/dashboard_controller.rb

	def index
		@project = @user.projects
		@task = @project.joins(:tasks)
---
SELECT "projects".* FROM "projects" INNER JOIN "tasks" ON "tasks"."project_id" = "projects"."id" WHERE "projects"."user_id" = ?  [["user_id", 5]]