app/controllers/dashboard_controller.rb

	def index
		@project = @user.projects
		projects_ids = @project.pluck(:id)
		@task =  Task.where(project_id: projects_ids )
---
SELECT "projects"."id" FROM "projects" WHERE "projects"."user_id" = ?  [["user_id", 2]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (?, ?) LIMIT ?  [["project_id", 3], ["project_id", 7], ["LIMIT", 1]]