app/controllers/projects_controller.rb

	def index
		@project = Project.all
---
SELECT "projects".* FROM "projects"

	def create
		@project = Project.new(projects_params)
		#@project.user = @user
		if @project.save!
---
INSERT INTO "projects" ("project_name", "project_type", "project_description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def update
		if @project.update(projects_params)
---
UPDATE "projects" SET "project_description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["project_description", "IOt and web portal for userdsds ."], ["updated_at", "2019-05-15 18:09:58.673248"], ["id", 4]]

	def set_project
		if params[:id]
			@project = Project.find_by(id: params[:id])
		else
			@project = Project.find_by(id: params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" IS NULL LIMIT ?  [["LIMIT", 1]]