app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "due_date", "project_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["due_date", "2019-05-25"], ["project_id", 1], ["user_id", 1], ["created_at", "2019-05-25 05:43:28.697821"], ["updated_at", "2019-05-25 05:43:28.697821"]]
---
	def create
		@task = Task.new(task_params)
		if @task.save!

UPDATE "tasks" SET "name" = ?, "description" = ?, "user_id" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "Simple"], ["description", "discript"], ["user_id", 3], ["updated_at", "2019-05-25 05:43:57.845991"], ["id", 10]]
---
	def update
		if @task.update(task_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def set_project
		@project = Project.find_by(id: params[:project_id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def set_task
		@task = Task.find_by(id: params[:id])