app/views/layouts/application.html.erb

        <span class="navbar-text text-success">
          User Role: <%= @user.roles_name.first.capitalize %>
---
SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 3]]